{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_0", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 4], "dtype": "float32", "sparse": false, "name": "input_0"}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 1, "rate": 1.0, "axis": 0}}, "bias_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 1, "rate": 1.0, "axis": 0}}}, "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"name": "bn_1", "class_name": "BatchNormalization", "config": {"name": "bn_1", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 1, "rate": 1.0, "axis": 0}}, "gamma_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 1, "rate": 1.0, "axis": 0}}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "relu_1", "class_name": "Activation", "config": {"name": "relu_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 1, "rate": 1.0, "axis": 0}}, "bias_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 1, "rate": 1.0, "axis": 0}}}, "inbound_nodes": [[["relu_1", 0, 0, {}]]]}, {"name": "bn_2", "class_name": "BatchNormalization", "config": {"name": "bn_2", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 1, "rate": 1.0, "axis": 0}}, "gamma_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 1, "rate": 1.0, "axis": 0}}}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "relu_2", "class_name": "Activation", "config": {"name": "relu_2", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 32, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 1, "rate": 1.0, "axis": 0}}, "bias_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 1, "rate": 1.0, "axis": 0}}}, "inbound_nodes": [[["relu_2", 0, 0, {}]]]}, {"name": "bn_3", "class_name": "BatchNormalization", "config": {"name": "bn_3", "trainable": true, "dtype": "float32", "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 1, "rate": 1.0, "axis": 0}}, "gamma_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 1, "rate": 1.0, "axis": 0}}}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "relu_3", "class_name": "Activation", "config": {"name": "relu_3", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["bn_3", 0, 0, {}]]]}, {"name": "phi", "class_name": "Dense", "config": {"name": "phi", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_3", 0, 0, {}]]]}, {"name": "eta", "class_name": "Dense", "config": {"name": "eta", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_3", 0, 0, {}]]]}, {"name": "pt", "class_name": "Dense", "config": {"name": "pt", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["relu_3", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["phi", 0, 0], ["eta", 0, 0], ["pt", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}